#+options: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: config
#+date: <2020-05-14 Thu>
#+author: Enze Chi
#+email: Enze.Chi@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 26.3 (Org mode 9.4)
#+startup: overview

** Go
Format code before save.
#+begin_src emacs-lisp
(after! go-mode
  (add-hook! 'before-save-hook #'gofmt-before-save))
#+end_src

#+RESULTS:
| gofmt-before-save |

